app/controllers/tax_controller.rb

    def deduction
        employees = Employee.all
        tax_deductions = employees.map { |employee| calculate_tax(employee) }
---
SELECT "employees".* FROM "employees" ORDER BY "employees"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "employees".* FROM "employees"